// 3.44
#include<iostream>
#include<cmath>
int main()
{
	int a1,a2,a3,b1,b2;
	std::cout<<"Введите сотни трехзначного число: ";
	std::cin>>a3;
	std::cout<<"Введите десятки трехзначного число: ";
	std::cin>>a2;
	std::cout<<"Введите единицы трехзначного число: ";
	std::cin>>a1;
	std::cout<<"Введите десятки двухзначного число: ";
	std::cin>>b2;
	std::cout<<"Введите единицы двухзначного число: ";
	std::cin>>b1;
	std::cout<<"Сотни: "<<a3+(a2+b2+(a1+b1)/10)/10<<"\nДесятки: "<<(a2+b2+(a1+b1)/10)%10<<"\nЕдиницы: "<<(a1+b1)%10;
}